## Terraform Plan Result
```
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat_eip: Refreshing state... [id=eipalloc-094cf01e77703fc93]
module.cdn.aws_cloudfront_origin_access_control.oac: Refreshing state... [id=EPHGQ65P5I5H3]
module.ecs.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-nginx]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.networking.aws_route53_zone.main: Refreshing state... [id=Z0632518T07Q6W1XR2EO]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0775b89028ae17e9a]
module.route53.aws_route53_zone.host_zone: Refreshing state... [id=Z0632518T07Q6W1XR2EO]
module.s3_cdn.aws_s3_bucket.bucket: Refreshing state... [id=testapp-dev-cdn-images]
module.acm_us.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/142e5edc-a3f6-478e-8cda-f6b66c142d5b]
module.acm_tokyo.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/4771d50a-a21b-4e33-96ab-d9384eabaed0]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/testapp-dev-nginx]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.waf.aws_wafv2_web_acl.waf: Refreshing state... [id=ac047f22-f824-4018-9850-e381cc7a67a4]
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Reading...
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Read complete after 0s [id=1077804475]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-app]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=testapp-dev-ecs-task-role]
module.iam.aws_iam_role.ecs_execution_role: Refreshing state... [id=testapp-dev-ecs-execution-role]
module.acm_tokyo.aws_route53_record.validation["manno-cloud.com"]: Refreshing state... [id=Z00663871DZD34KEY9AVZ__9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com._CNAME]
module.acm_us.aws_route53_record.validation["cdn.manno-cloud.com"]: Refreshing state... [id=Z00663871DZD34KEY9AVZ__18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com._CNAME]
module.acm_tokyo.aws_acm_certificate_validation.validation: Refreshing state... [id=2025-11-25 03:40:11.593 +0000 UTC]
module.acm_us.aws_acm_certificate_validation.validation: Refreshing state... [id=2025-11-25 05:31:42.528 +0000 UTC]
module.iam.aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=testapp-dev-ecs-execution-role-20251125033953243700000004]
module.ecs.aws_ecs_task_definition.nginx: Refreshing state... [id=testapp-dev-nginx]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=testapp-dev-task]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-09be9fbce93a2762d]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-00acbd0408e9c7853]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-0ca987c290cd62990]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-03b9484e9cf2550b0]
module.vpc.aws_subnet.private["private3"]: Refreshing state... [id=subnet-095c53f847ced78ad]
module.vpc.aws_subnet.public["public3"]: Refreshing state... [id=subnet-09d0a9b6b32b40828]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-02281ad2fd7fb33b3]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-0ad22b6f4162a4fa3]
module.security_group.aws_security_group.security_group["ecs_sg"]: Refreshing state... [id=sg-0839630f07197f0f0]
module.security_group.aws_security_group.security_group["rds_sg"]: Refreshing state... [id=sg-0e99a3967615bd87d]
module.security_group.aws_security_group.security_group["vpc_endpoint_sg"]: Refreshing state... [id=sg-079f0d8b3c3d9f9e9]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0d22cf9c5a9d8dc21]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/9d4eb1f9b241c254]
module.alb_ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-ecs-tg/74daf031a1f62a83]
module.s3_cdn.aws_s3_bucket_public_access_block.access_block: Refreshing state... [id=testapp-dev-cdn-images]
module.s3_cdn.aws_s3_bucket_policy.policy: Refreshing state... [id=testapp-dev-cdn-images]
module.rds.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=testapp-dev-db-subnet-group]
aws_security_group_rule.alb_to_ec2: Refreshing state... [id=sgrule-597342601]
aws_security_group_rule.vpc_endpoint_egress: Refreshing state... [id=sgrule-3221989083]
aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-3204302517]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-2800541007]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-1301733751]
module.alb_ecs.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-ecs-alb/6e52c6cb27e836f3]
aws_security_group_rule.allow_alb_to_ecs: Refreshing state... [id=sgrule-2437410910]
aws_security_group_rule.ecs_egress: Refreshing state... [id=sgrule-1888164772]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/0d15ca4ab782eeab]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-0e8f65ae54e05a3fa]
aws_security_group_rule.allow_ec2_to_rds: Refreshing state... [id=sgrule-1582899643]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-4233078305]
aws_security_group_rule.vpc_endpoint_ingress: Refreshing state... [id=sgrule-308120189]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0d71601cb60d070f7]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-04cca98423acf55ac]
module.vpc_endpoint.aws_vpc_endpoint.interface["sts"]: Refreshing state... [id=vpce-0079f18e963c59f4d]
module.vpc_endpoint.aws_vpc_endpoint.interface["monitoring"]: Refreshing state... [id=vpce-070ab556472e540f6]
module.vpc_endpoint.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-03948398a06a76ccb]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-002dc716b31be7f0e]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-0ea49a1486a110c7f]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-0d9a8ea9e56ccfc2f]
module.vpc_endpoint.aws_vpc_endpoint.interface["events"]: Refreshing state... [id=vpce-011697cd8c5a43546]
module.vpc_endpoint.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-0c5aa6ed7dc87f90b]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-0124d10728f1f3947]
module.rds.aws_db_instance.dbinstance: Refreshing state... [id=db-6W4SS2IKNZUXLJN3PCJ6JRUPJU]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-02311dc496e8a3055]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-0a88766ff0e800c8f]
module.vpc.aws_route_table_association.public["public3"]: Refreshing state... [id=rtbassoc-0ad6b5d4cd0daa83b]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-049dc72d87a79f905]
module.alb_ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/6e52c6cb27e836f3/65d8e0592c3dbb5d]
module.alb_ecs.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/6e52c6cb27e836f3/2ed279b96992591c]
module.alb.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/0d15ca4ab782eeab/d3b6f495fd32aafd]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/0d15ca4ab782eeab/d20e1f45d791951f]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]
module.ecs.aws_ecs_service.nginx: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:service/testapp-dev-cluster/testapp-dev-svc]
module.cdn.aws_cloudfront_distribution.cdn: Refreshing state... [id=E1SEMKAAQXMRC2]
module.vpc.aws_route_table_association.private["private2"]: Refreshing state... [id=rtbassoc-0abf75b67f42471e0]
module.vpc.aws_route_table_association.private["private3"]: Refreshing state... [id=rtbassoc-0e997befb55ca0ce0]
module.vpc.aws_route_table_association.private["private1"]: Refreshing state... [id=rtbassoc-01ec32666f40c31b3]
module.vpc_endpoint.aws_vpc_endpoint.gateway["dynamodb"]: Refreshing state... [id=vpce-046f45f70f90779d5]
module.vpc_endpoint.aws_vpc_endpoint.gateway["s3"]: Refreshing state... [id=vpce-0c8753ce2c897cde3]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:service/testapp-dev-cluster/testapp-dev-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acm_tokyo.aws_acm_certificate_validation.validation must be replaced
-/+ resource "aws_acm_certificate_validation" "validation" {
      ~ id                      = "2025-11-25 03:40:11.593 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.acm_tokyo.aws_route53_record.validation["manno-cloud.com"] must be replaced
-/+ resource "aws_route53_record" "validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com" -> (known after apply)
      ~ id                               = "Z00663871DZD34KEY9AVZ__9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com"
      ~ zone_id                          = "Z00663871DZD34KEY9AVZ" -> "Z0632518T07Q6W1XR2EO" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.acm_us.aws_acm_certificate_validation.validation must be replaced
-/+ resource "aws_acm_certificate_validation" "validation" {
      ~ id                      = "2025-11-25 05:31:42.528 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.acm_us.aws_route53_record.validation["cdn.manno-cloud.com"] must be replaced
-/+ resource "aws_route53_record" "validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com" -> (known after apply)
      ~ id                               = "Z00663871DZD34KEY9AVZ__18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com"
      ~ zone_id                          = "Z00663871DZD34KEY9AVZ" -> "Z0632518T07Q6W1XR2EO" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.cdn.aws_cloudfront_distribution.cdn will be updated in-place
  ~ resource "aws_cloudfront_distribution" "cdn" {
        id                              = "E1SEMKAAQXMRC2"
        tags                            = {
            "Env"     = "dev"
            "Name"    = "testapp-dev-cdn-distribution"
            "Project" = "testapp"
        }
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:695394391597:certificate/4d4f0ec6-d842-4696-8adf-6ecbdc20fb8a" -> "arn:aws:acm:ap-northeast-1:695394391597:certificate/142e5edc-a3f6-478e-8cda-f6b66c142d5b"
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.networking.aws_route53_zone.main will be destroyed
  # (because aws_route53_zone.main is not in configuration)
  - resource "aws_route53_zone" "main" {
      - arn                 = "arn:aws:route53:::hostedzone/Z0632518T07Q6W1XR2EO" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z0632518T07Q6W1XR2EO" -> null
      - name                = "manno-cloud.com" -> null
      - name_servers        = [
          - "ns-1242.awsdns-27.org",
          - "ns-1632.awsdns-12.co.uk",
          - "ns-336.awsdns-42.com",
          - "ns-609.awsdns-12.net",
        ] -> null
      - primary_name_server = "ns-336.awsdns-42.com" -> null
      - tags                = {
          - "Env"     = "dev"
          - "Name"    = "testapp-dev-zone"
          - "Project" = "testapp"
        } -> null
      - tags_all            = {
          - "Env"     = "dev"
          - "Name"    = "testapp-dev-zone"
          - "Project" = "testapp"
        } -> null
      - zone_id             = "Z0632518T07Q6W1XR2EO" -> null
        # (1 unchanged attribute hidden)
    }

  # module.route53.aws_route53_record.record will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "manno-cloud.com"
      + type            = "A"
      + zone_id         = "Z0632518T07Q6W1XR2EO"

      + alias {
          + evaluate_target_health = false
          + name                   = "dfc5jayelbl4o.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 5 to add, 1 to change, 5 to destroy.

Warning: Reference to undefined provider

  on main.tf line 230, in module "acm_tokyo":
 230:     aws = aws

There is no explicit declaration for local provider name "aws" in
module.acm_tokyo, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->